# =============================================================================
# CLI Tools (already installed via Homebrew)
# =============================================================================
brew "coreutils"
brew "gh"
brew "htop"
brew "lesspipe"
brew "node"
brew "node@22"
brew "pyenv"
brew "python@3.13"
brew "thefuck"
brew "tree"
brew "wget"
brew "wifi-password"
brew "yarn"
brew "youtube-dl"

# =============================================================================
# CLI Tools (suggested additions)
# =============================================================================
brew "jq"
brew "mas"
brew "ripgrep"

# =============================================================================
# Cask Apps (already installed via Homebrew)
# =============================================================================
cask "chromium"
cask "macs-fan-control"
cask "stats"

# =============================================================================
# Cask Apps (currently installed outside Homebrew — review & uncomment as needed)
# =============================================================================
cask "1password"
# cask "bambu-studio"
# cask "battle-net"
cask "betterdisplay"
# cask "chatgpt"
cask "claude"
cask "cursor"
# cask "displaylink"
# cask "divvy"
# cask "elgato-camera-hub"
# cask "elgato-control-center"
cask "figma"
cask "ghostty"
cask "github"
# cask "gopro-quik"
cask "google-chrome"
cask "google-drive"
# cask "parallels"
# cask "surfshark"
# cask "todoist"
# cask "transmission"
# cask "uhk-agent"
cask "visual-studio-code"
cask "warp"
cask "whatsapp"
cask "zoom"

# =============================================================================
# Mac App Store (requires `mas` — uncomment what you want)
# =============================================================================
# mas "Xcode", id: 497799835
# mas "Keynote", id: 409183694
# mas "Numbers", id: 409203825
# mas "Pages", id: 409201541
# mas "Goodnotes", id: 1444383602
# mas "Todoist", id: 585829637
# mas "CopyClip", id: 595191960
# mas "GIPHY CAPTURE", id: 668208984
